Repository: sheisstarwithoutmoon/Harvest-Hub
Catalog: lib/l10n/app_*.arb
Languages: te

# helloWorld
source: Welcome to Harvest Hub
te: HarvestHubకి స్వాగతం

# welcomeMessage
source: Revolutionize your agricultural journey effortlessly. Navigate through a world of premium farming products from the comfort of your home. Your farm, your choicesâ€”seamless, convenient, and quality at your fingertips.
te: మీ వ్యవసాయ ప్రయాణాన్ని అప్రయత్నంగా విప్లవం చేయండి. మీ ఇంటి సౌకర్యం నుండి ప్రీమియం వ్యవసాయ ఉత్పత్తుల ప్రపంచంలో నావిగేట్ చేయండి. మీ పొలం, మీ ఎంపికలు-అతుకులు లేని, అనుకూలమైన మరియు మీ చేతివేళ్ల వద్ద నాణ్యత

source: Free Consultation
te: ఉచిత కన్సల్టేషన్

# freeConsultation1
source: Get Consultation from top scientists about your crops and field
te: మీ పొలం మరియు పంటల గురించి అగ్రశ్రేణి శాస్త్రవేత్తలను సంప్రదించండి

# freeConsultation2
source: Call Now
te: ఇప్పుడే కాల్ చేయండి

# featuredProducts
source: ðŸ”¥Trending Products
te: ఫీచర్ చేసిన ఉత్పత్తులు

source: See All
te: అన్నింటిని చూడు

source: Weather
te: వాతావరణం

# degree
source: Today is expected to be sunny
te: ఈరోజు ఎండగా ఉంటుందని అంచనా

# degree2
source: Recommendation : It is a great day to Harvest crops as the sun will prevent any bacterias from forming
te: సిఫార్సు: సూర్యరశ్మి ఎటువంటి బ్యాక్టీరియా ఏర్పడకుండా

# hm1
source: Home
te: హోమ్

# hm2
source: Services
te: సేవలు

# hm3
source: Cart
te: బండి

# hm4
source: Profile
te: ప్రొఫైల్

# service
source: Services
te: సేవలు
